[
    {
        "input": "What is fed",
        "output": "A group of KIIT TBI students called Federation of Entrepreneurship Development (FED) hopes to inspire those who have an entrepreneurial spirit by uniting all potential startup ideas onto a one platform. FED helps you get in touch with the greatest contacts, resources, and mentors by organising events that raise awareness of entrepreneurship."
    },
    {
        "input": "What is fed admired for?",
        "output": "We aim to nurture entrepreneurship through creative, authentic, and efficient techniques. There is no I, only we. We exist as a team, function as a team, and execute as a team."
    },
    {
        "input": "what was the FEDpreneur Show",
        "output": "The FEDpreneur Show was our podcast series in which we hosted India's most successful entrepreneurs and strove to uncover their secrets to success, learning, and entertainment. Every conversation on The FEDpreneur Show offered intellectual, educational, and extreme learning opportunities to the audience. It was about a visionary entrepreneur session with a group of multi-talented and experienced business owners that aided our young brains to stand strong in marketing and startup endeavors."
    },
    {
        "input": "who all leads fed",
        "output": "We are a tight-knit community of passionate people devoted to bringing about vibrant and awe-inspiring changes in the field of Entrepreneurship. The pillars of our crew are the Marketing group, the Creative group, the Technical group, and the Operations group. Further details are on the team page of the website."
    },
    {
        "input": "how can i contact fed",
        "output": "You may get in touch with us through the website's contact page, where you can also discover further details."
    },
    {
        "input": "What is fed's mission?",
        "output": "We aim to nurture entrepreneurship through creative, authentic, and efficient techniques. Being a forum for young entrepreneurs and assisting them in launching their businesses via providing useful information that indicates an organization's ability to function as a cohesive one. Organizing entrepreneurial activities to boost the confidence of aspiring entrepreneurs."
    },
    {
        "input": "what was the skillhunt about",
        "output": "Skill Hunt was an immersive event that explored the forefront of innovation across four dynamic cohorts: AI/ML, UI/UX, digital marketing, and Prompt Engineering. Participants could dive into hands-on workshops, engaging discussions, and networking opportunities tailored to each cohort's unique landscape."
    },
    {
        "input": "what was the bizz battle about",
        "output": "BIZZ-BATTLE was an engaging business challenge event designed for aspiring business leaders. It consisted of three rounds, each aimed at testing participants' knowledge, agility, and strategic acumen. The event began with Round 1, a business quiz, and successful teams moved to Round 2, a treasure hunt. The final round presented a real-world business scenario."
    },
    {
        "input": "what was stonkaholic about",
        "output": "This incredible competition allowed all the participants to experience hands-on stock trading and hone their financial literacy. Participants traded with virtual money, kept an eye on the market, and bested the competition with their wits."
    },
    {
        "input": "what are the past events",
        "output": "For information on past and future events, you can check out our Insta page at https://www.instagram.com/fedkiit/ or connect with us on LinkedIn at https://www.linkedin.com/company/fedkiit/"
    },
    {
        "input": "who is the president of fed",
        "output": "Anurag Prasoon is the president of FED."
    },
    {
        "input": "who is the director of tech",
        "output": "Prityanshu Singh"
    },
    {
        "input": "hello",
        "output": "Hi, Nice to meet you. Do you have any questions related to FED?"
    },
    {
        "input": "what was omega 4.0?",
        "output": "Omega was FED's flagship event, which consisted of 4 different segments, focusing on the development of entrepreneurship and other skills."
    },
    {
        "input": "What were the rewards for past events?",
        "output": "We had exciting prizes for the winners of our events."
    },
    {
        "input": "What did participants have to do in pitchers?",
        "output": "Contestants presented their ideas in front of investors and other participants. It was similar to Shark Tank, but participants could also invest in other ideas."
    },
    {
        "input": "What was FPL?",
        "output": "It was an imitation of the Indian Premier League cricket auctions."
    },
    {
        "input": "How was the pitchers event different from previous editions?",
        "output": "In that edition, the pitchers could pitch as well as invest in other ideas."
    },
    {
        "input": "How to connect with the Organising Committee from the FED website?",
        "output": "Our website has all the info related to our members, and you can directly head to any of our members' social media accounts to connect with them. If you have any doubts, you can ask us on https://www.instagram.com/fedkiit/ and https://www.fedkiit.com/ (our official website)."
    },
    {
        "input": "who created this bot",
        "output": "Amaldeep Patra, senior technical executive, and the Tech team have developed this bot."
    },
    {
        "input": "what events did fed include",
        "output": "FED organized many events including Omega, Skillhunt, Bizz Battle, and more."
    },
    {
        "input": "thanks",
        "output": "You're welcome!"
    },
    {
        "input": "who developed the website",
        "output": "The Tech department of FED developed this beautiful website."
    },
    {
        "input": "were there any events related to omega",
        "output": "There were multiple events under Omega 4.0 like a hackathon, FPL, etc."
    },
    {
        "input": "do you have a girlfriend",
        "output": "I'm all about helping you out, no time for dating!"
    },
    {
        "input": "tell me more about it",
        "output": "Can you please specify?"
    },
    {
        "input": "Tell me about the Pixel AI event",
        "output":"Pixel-AI-Hack was an immersive hackathon that brought together designers, developers, and innovators to explore the synergy between AI, Design Thinking, and Technology. Participants ideated and created AI-powered solutions for real-world challenges."},
    {
        "input": "What were the benefits of joining Pixel-AI-Hack?",
        "output": "Joining Pixel-AI-Hack gave participants access to industry experts, design thinking workshops, real-world problem-solving challenges, and the chance to win amazing prizes."
    },
    {
        "input": "Who organized the Pixel AI event?",
        "output": "The event was organized by FEDKIIT in collaboration with TBI (Technology Business Incubator) to promote AI-driven innovation and problem-solving using design thinking methodologies."
    },
    {
        "input": "How could one register for the Pixel AI event?",
        "output": "Registration for the event was made available through a link on the official website: https://www.fedkiit.com/Pixel_AI_Hack"
    },
    {
        "input": "When and where was the Pixel AI event held?",
        "output": "Pixel-AI-Hack was conducted across three days: - Day 1 (Workshops & Ideation) at Camp-17 Audi - Day 2 (Pitching Round) at Camp-14 Lab - Day 3 (Final Submission & Showcase) was held online."
    },
    {
        "input": "Was there a participation fee for Pixel-AI-Hack?",
        "output": "No, participation in Pixel-AI-Hack was completely free."
    },    
    {
        "input": "Where can I find more details about the Pixel AI event?",
        "output": "Details about past events like Pixel-AI-Hack are archived on the official FEDKIIT website and social media channels."
    },
    {
        "input": "What is Omega 5.0?",
        "output": "OMEGA 5.0 is FED's upcoming flagship event, renowned for attracting over 500 eager students each year. It embodies our vision of promoting entrepreneurship, fostering innovation, and encouraging collaborative problem-solving among students. This year's Omega 5.0 promises to be more engaging and inspiring than ever, featuring four thrilling sub-events."
    },
    {
        "input": "When is Omega 5.0?",
        "output": "Omega 5.0 will be held on the 16th and 17th of August, 2025. The timings are from 9:00 AM to 2:00 PM and 3:00 PM to 6:00 PM."
    },
    {
        "input": "What is Innovate-X?",
        "output": "InnoVateX 2025 is a hackathon designed to empower participants with a real-world problem-solving environment. Teams will explore existing digital platforms, identify ways to improve the user experience, and foster a blend of technical creativity and entrepreneurial vision."
    },
    {
        "input": "What is the Strategic Pivot Challenge?",
        "output": "This is a thrilling 5-hour simulation where teams of 3-5 act as elite crisis consultants for a fictional company. They must craft a strategic pivot plan to navigate an unexpected turmoil, adapting to dynamic 'Stakeholder Feedback Bursts' under pressure."
    },
    {
        "input": "What is FPL 3.0?",
        "output": "FPL 3.0 is an IPL-inspired auction event where teams with a virtual budget of 75 crores bid on and draft a dream cricket squad. It's a game of strategy, teamwork, and management prowess."
    },
    {
        "input": "Why should I attend Omega 5.0?",
        "output": "Attending Omega 5.0 offers inspiration and knowledge, networking opportunities, hands-on experience, and exposure and recognition for your ideas and skills."
    },
    {
        "input": "Who are the sponsors for Omega 5.0?",
        "output": "The sponsors for Omega 5.0 are UNSTOP and UNLOX."
    },
    {
        "input": "How do I register for Omega 5.0?",
        "output": "Stay updated with our Instagram posts and the FED site. A registration link will be provided once registrations are open. You can also scan the QR code on our official Instagram account: https://www.instagram.com/fedkiit/."
    },
    {
        "input": "What are the rewards for Omega 5.0?",
        "output": "We have exciting prizes for the winners. Stay updated with all our announcements to discover what we have in store!"
    },
    {
        "input": "Do all team members have to be from KIIT?",
        "output": "No, there is no such specific condition. You are free to select your teammates from anywhere."
    },
    {
        "input": "Can a single person participate in all events of Omega?",
        "output": "Yes, contestants can participate alone or as a team, depending on the event rules."
    },
    {
        "input": "Tell me about the FED Orientation.",
        "output": "The FED Orientation 2025 is a power-packed session to kickstart your journey at KIIT. You can get inspired by real student-led start-up stories and learn how to explore the entrepreneurial ecosystem at KIIT."
    },
    {
        "input": "What is the team size for Innovate-X?",
        "output": "The team size for Innovate-X is 2-4 members and participation is free."
    },
    {
        "input": "What is the team size for the Strategic Pivot Challenge?",
        "output": "The team size for the Strategic Pivot Challenge is 3-5 members and participation is free."
    },
    {
        "input": "What is the team size for FPL 3.0?",
        "output": "The team size for FPL 3.0 is 3-5 members and participation is free."
    },
    {
        "input": "How much does it cost to register for Omega 5.0?",
        "output": "Registration for Omega 5.0 is ₹89 for individual participants. However, participation in the sub-events like Innovate-X, Strategic Pivot Challenge, and FPL 3.0 is free for teams."
    }
]
